       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBA-PROGRAM.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GLOBAL-WELCOME PIC X(50) VALUE "Hello World!".

       PROCEDURE DIVISION.

       MAIN-PROGRAM.
           PERFORM DOTHETHING.
           STOP RUN.

       DOTHETHING.
           DISPLAY GLOBAL-WELCOME.

